## :x: terraform/aws/tfaction:  tfmigrate apply

[Build link](https://github.com/boxp/arch/actions/runs/8222293573)

```
$ tfmigrate apply
```

<details>


```
time="2024-03-10T13:17:14Z" level=info msg="download and unarchive the package" aqua_version=2.23.2 env=linux/amd64 exe_name=tfmigrate package_name=minamijoyo/tfmigrate package_version=v0.3.18 program=aqua registry=standard
2024/03/10 13:17:14 [INFO] [runner] unapplied migration files: [20240310115715_import_tfaction.hcl 20240310131123_import_tfaction_2.hcl]
2024/03/10 13:17:14 [INFO] [runner] load migration file: tfmigrate/20240310115715_import_tfaction.hcl
2024/03/10 13:17:14 [INFO] [migrator] start state migrator plan phase for apply
2024/03/10 13:17:14 [INFO] [migrator@.] terraform version: 1.6.2
2024/03/10 13:17:14 [INFO] [migrator@.] initialize work dir
2024/03/10 13:17:15 [INFO] [migrator@.] get the current remote state
2024/03/10 13:17:16 [INFO] [migrator@.] override backend to local
2024/03/10 13:17:16 [INFO] [executor@.] create an override file
2024/03/10 13:17:16 [INFO] [migrator@.] creating local workspace folder in: terraform.tfstate.d/default
2024/03/10 13:17:16 [INFO] [executor@.] switch backend to local
2024/03/10 13:17:17 [INFO] [migrator@.] compute a new state
2024/03/10 13:17:26 [INFO] [migrator@.] check diffs
2024/03/10 13:17:28 [INFO] [migrator@.] unexpected diffs, ignoring as force option is true: failed to run command (exited 2): terraform plan -state=/tmp/tmp1511058946 -out=/tmp/tfplan1972737162 -input=false -no-color -detailed-exitcode
stdout:
module.aws.data.aws_iam_policy_document.put_tfmigrate_history: Reading...
module.aws.data.aws_iam_policy_document.read_tfmigrate_history: Reading...
module.aws.data.aws_caller_identity.current: Reading...
module.aws.data.aws_iam_policy_document.read_terraform_state: Reading...
module.aws.data.aws_iam_policy_document.put_terraform_state: Reading...
module.aws.data.aws_iam_policy_document.put_tfmigrate_history: Read complete after 0s [id=54634239]
module.aws.data.aws_iam_policy_document.put_terraform_state: Read complete after 0s [id=54634239]
module.aws.data.aws_iam_policy_document.read_tfmigrate_history: Read complete after 0s [id=1885407253]
module.aws.data.aws_iam_policy_document.read_terraform_state: Read complete after 0s [id=1885407253]
module.aws.data.aws_caller_identity.current: Read complete after 1s [id=839695154978]
module.aws.data.aws_iam_policy_document.assume_role_policy_main: Reading...
module.aws.data.aws_iam_policy_document.assume_role_policy_pr: Reading...
module.aws.data.aws_iam_policy_document.assume_role_policy_pr: Read complete after 0s [id=1724748303]
module.aws.data.aws_iam_policy_document.assume_role_policy_main: Read complete after 0s [id=3859806597]
aws_iam_role_policy_attachment.tfmigrate_apply_readonly: Refreshing state... [id=GitHubActions_Terraform_AWS_tfmigrate_apply-arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.terraform_plan_readonly: Refreshing state... [id=GitHubActions_Terraform_AWS_terraform_plan-arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.tfmigrate_plan_readonly: Refreshing state... [id=GitHubActions_Terraform_AWS_tfmigrate_plan-arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.terraform_apply_admin: Refreshing state... [id=GitHubActions_Terraform_AWS_terraform_apply-arn:aws:iam::aws:policy/AdministratorAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws.aws_iam_policy.put_tfmigrate_history will be created
  + resource "aws_iam_policy" "put_tfmigrate_history" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "GitHubActions_Terraform_AWS_write_tfmigrate_history"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aws.aws_iam_policy.read_tfmigrate_history will be created
  + resource "aws_iam_policy" "read_tfmigrate_history" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "GitHubActions_Terraform_AWS_read_tfmigrate_history"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aws.aws_iam_role.terraform_apply will be created
  + resource "aws_iam_role" "terraform_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_terraform_apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.terraform_plan will be created
  + resource "aws_iam_role" "terraform_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_terraform_plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.tfmigrate_apply will be created
  + resource "aws_iam_role" "tfmigrate_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_tfmigrate_apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.tfmigrate_plan will be created
  + resource "aws_iam_role" "tfmigrate_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_tfmigrate_plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_put_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_read_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_plan_read_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_plan"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan1972737162

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan1972737162"

stderr:
2024/03/10 13:17:28 [INFO] [executor@.] remove the override file
2024/03/10 13:17:28 [INFO] [executor@.] remove the workspace state folder
2024/03/10 13:17:28 [INFO] [executor@.] switch back to remote
2024/03/10 13:17:29 [INFO] [migrator] start state migrator apply phase
2024/03/10 13:17:29 [INFO] [migrator] push the new state to remote
2024/03/10 13:17:29 [ERROR] [runner] failed to apply: 20240310115715_import_tfaction.hcl
failed to run command (exited 1): terraform state push /tmp/tmp2260274875
stdout:

stderr:
╷
│ Error: Backend initialization required, please run "terraform init"
│ 
│ Reason: Unsetting the previously set backend "local"
│ 
│ The "backend" is the interface that Terraform uses to store state,
│ perform operations, etc. If this message is showing up, it means that the
│ Terraform configuration you're using is using a custom configuration for
│ the Terraform backend.
│ 
│ Changes to backend configurations require reinitialization. This allows
│ Terraform to set up the new configuration, copy existing state, etc. Please
│ run
│ "terraform init" with either the "-reconfigure" or "-migrate-state" flags
│ to
│ use the current configuration.
│ 
│ If the change reason above is incorrect, please verify your configuration
│ hasn't changed and try again. At this point, no changes to your existing
│ configuration or state have been made.
╵



```


</details>

<!-- github-comment: {"JobName":"apply","SHA1":"90369ef05351fa1c17c0bb71508985defc700340","TemplateKey":"tfmigrate-apply","Vars":{},"WorkflowName":"apply"} -->